# GetCableTraySizesIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes..::..GetCableTraySizesIterator Method
CableTraySizes Class See Also
---
Returns a CableTraySizeIterator to the MEP cable tray sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public CableTraySizeIterator GetCableTraySizesIterator()
```

Visual Basic
---
```text
Public Function GetCableTraySizesIterator As CableTraySizeIterator
```

Visual C++
---
```text
public:
CableTraySizeIterator^ GetCableTraySizesIterator()
```

# See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace